{
    ":en": "",
    "Webアプリケーションフレームワークの作り方 in Python:en": "How to make a web application framework in Python",
    "こんにちは、芝田 将 ( `@c_bata_ <https://twitter.com/c_bata_>`_ ) です。:en": "Hello, Masashi Shibata (`@ c_bata _ <https://twitter.com/c_bata_> `_).",
    "はじめに:en": "Introduction",
    "対象読者:en": "Audience",
    "目次:en": "table of contents",
    "関連URL:en": "Related URL",
    "`スライド <https://c-bata.link/webframework-in-python/slide.html#1>`_:en": "`Slide <https://c-bata.link/webframework-in-python/slide.html#1> `_",
    "`動画(Youtube) <https://www.youtube.com/watch?v=S-InxJA5NOg>`_:en": "`Video (Youtube) <https://www.youtube.com/watch?v=S-InxJA5NOg> `_",
    "Indices and tables:en": "Indices and tables",
    ":ref:`genindex`:en": ": Ref: `genindex`",
    ":ref:`search`:en": ":ref:`search`",
    " :en": " ",
    " \"Webアプリケーションフレームワークの作り方 in Python:en": "&quot;How to make a Web application framework in Python",
    " \"こんにちは、芝田 将 ( `@c_bata_ <https://twitter.com/c_bata_>`_ ) です。:en": "&quot;Hello, Masashi Shibata (` @ c_bata _ <https://twitter.com/c_bata_> `_).",
    " この資料はPyCon JP 2016で行った `「基礎から学ぶWebアプリケーションフレームワークの作り方」 <https://pycon.jp/2016/ja/schedule/presentation/14/>`_ の書き起こし資料です。 誤字等があれば、Issue or PRをお待ちしております。:en": "This document is based on PyCon JP 2016 `` How to make a Web application framework to learn from the basics&#39; <https://pycon.jp/2016/ja/schedule/presentation/14/> It is a transcript of `_. We will be waiting for Issue or PR if there are misspellings etc.",
    " \"はじめに:en": "&quot;Introduction",
    " 筆者は自分の一番の強みをサーバサイドにしようと決めた時、まずはDjangoやFlaskなど主要なWebフレームワークの実装を知っておきたいと思いました。 何らかのバグにぶつかった時に、自分でも修正できるようにしておきたいからです。 そこで学生時代に、BottleやFlaskの実装を読み進めていました。 最初はどこから手をつけて読んでいけばいいかも分かりませんでしたが、頭を抱えながらも読み進めることで各種WSGIフレームワークの全体像が見えるようになってきました。 各種フレームワークの設計方針の違いに気づき、フレームワークを利用しているだけでは気づくことのできなかった多くのHTTPに関する知識を得ることができました。 最近ではGo言語などPython以外の言語を書くことも多くなってきましたが、ここで得た多くの知識が役に立ったと感じています。:en": "When I decided to make my best advantage on the server side, I first wanted to know the implementation of major web frameworks such as Django and Flask. It is because I want to be able to fix it myself when I encounter some bug. So while I was a student I was reading the implementation of Bottle and Flask. At first I did not know where to start by reading hands, but I could see the whole picture of various WSGI frameworks by reading while holding my head. I noticed the differences in the design policies of the various frameworks and gained a lot of knowledge about HTTP that I could not notice by merely using the framework. Recently, it has become more common to write languages ​​other than Python such as Go language, but I feel that many knowledge gained here has been useful.",
    " とはいえ筆者のように知識が浅いまま、最初から数千行〜数十万行のコードベースを読み進めるのは非常に大変です。 この資料では200行に満たないシンプルなWebフレームワークの作り方をボトムアップで解説します。 小さなフレームワークを1から作ってみることは、全体像を把握するのに有効なやり方です。 ここで解説する内容を抑えておけば、Bottleの実装を読むことにはそれほど苦労しないでしょう。 またFlaskやDjangoを読むときにも全体像を把握しながら読み進められれば、どこから手をつければいいかも想像がつきます。:en": "However, it is very difficult to read the code base of thousands of lines to hundreds of thousands of lines from the beginning while the knowledge is shallow like the author. This article will explain how to make a simple web framework that is less than 200 lines in a bottom-up manner. Creating a small framework from 1 is an effective way to grasp the overall picture. If you keep down the content to explain here, you will not have much trouble reading Bottle&#39;s implementation. Also, when you read Flask or Django, you can imagine where you should start a hand as long as you can read through while understanding the overall picture.",
    " \"対象読者:en": "&quot;Audience",
    " この資料では、実際にPythonでWebアプリケーションのフレームワークを作っていきます。 そのため既にWeb開発の経験があり、基本的なHTTPの知識があると理解がしやすいかと思います。 もし読み進めていく中で難しいと感じた場合は、これらの知識をもう少し復習してみるといいかもしれません。 どうしてもわからない場合はGithubの方にIssueをたてていただけると、そのあたりの補足説明を増やせるかもしれません。 お気軽に連絡ください。:en": "In this article, we will actually create a framework for Web applications in Python. For that reason, I have already experienced web development and I think that it is easy to understand if there is basic HTTP knowledge. If you feel it is difficult as you continue reading, you may want to review these knowledge a bit more. If you do not understand in any way, you can increase Issue to Github, you may increase supplementary explanation about that. Please do not hesitate to contact me.",
    " \"目次:en": "&quot;table of contents",
    " \"関連URL:en": "&quot;Related URL",
    " `Github <https://github.com/c-bata/webframework-in-python>`_ ( `WSGIフレームワーク <https://github.com/c-bata/webframework-in-python/blob/master/src/app.py>`_  / `WSGIサーバー <https://github.com/c-bata/webframework-in-python/blob/master/src/wsgi_server.py>`_ / `サンプルアプリケーション <https://github.com/c-bata/webframework-in-python/blob/master/src/main.py>`_ ):en": "`Github <https://github.com/c-bata/webframework-in-python> `_ (` WSGI framework <https://github.com/c-bata/webframework-in-python/blob/master/src/app.py> `_ /` WSGI server <https://github.com/c-bata/webframework-in-python/blob/master/src/wsgi_server.py> `_ /` Sample application <https://github.com/c-bata/webframework-in-python/blob/master/src/main.py> `_)",
    " \"`スライド <https://c-bata.link/webframework-in-python/slide.html#1>`_:en": "&quot;` Slide <https://c-bata.link/webframework-in-python/slide.html#1> `_",
    " \"`動画(Youtube) <https://www.youtube.com/watch?v=S-InxJA5NOg>`_:en": "&quot;` Video (Youtube) <https://www.youtube.com/watch?v=S-InxJA5NOg> `_",
    " \"Indices and tables:en": " \"Indices and tables",
    " \":ref:`genindex`:en": "&quot;: Ref:` genindex`",
    " \":ref:`search`:en": " \":ref:`search`",
    " \"Kobinについて:en": "&quot;About Kobin",
    " \"WSGIミドルウェア:en": "&quot;WSGI Middleware",
    " \"ミドルウェアとは:en": "&quot;What is Middleware",
    " 次はJavaScriptやCSS、画像などの静的ファイルを返す機能をつけてみましょう。 本番環境では、パフォーマンスの観点からNginx等で直接返すことが多いかもしれませんが、 開発環境でもNginxなどの設定をしておくのは、かなり面倒です。:en": "Next let&#39;s add a function to return static files such as JavaScript, CSS, images and so on. In a production environment, it may be returned directly from Nginx etc. from a performance point of view, but it is rather troublesome to set Nginx etc even in the development environment.",
    " \"静的ファイルを返す機能をどのように追加するか、いくつか方法はありますが今回はWSGIのミドルウェアとして実装してみます。:en": "&quot;There are several ways to add the function to return static files, but this time I will implement it as WSGI middleware.",
    " \"ミドルウェアは、Webサーバ側からはWSGIアプリケーションのように見えWSGIアプリケーション側からはWebサーバのように見えます。:en": "&quot;Middleware looks like a WSGI application from the Web server side and it looks like a Web server from the WSGI application side.",
    " \"静的ファイルの配信:en": "&quot;Static file delivery",
    " CSSやJS、画像などの静的ファイルの配信は、本番環境ではNginx等で返すことが多いかと思います。 しかし開発中にNginx等で返すように設定するのは面倒です。:en": "I think that the delivery of static files such as CSS, JS, images, etc. is often returned by Nginx etc. in the production environment. However it is troublesome to set it to return with Nginx etc. during development.",
    " 開発環境でのみ、静的ファイルを配信するミドルウェアを有効化してみましょう。 静的ファイルの配信方法の実装については、ここでは割愛します。 既に公開されている静的ファイルを返すミドルウェアは古いものが多かったので筆者の方で用意しました。:en": "Let&#39;s activate middleware that distributes static files only in the development environment. Implementation of static file delivery method is omitted here. Middleware that returns already published static files was old, so many of them were prepared, so I prepared it by the author.",
    " `wsgi-static-middleware <https://pypi.python.org/pypi/wsgi-static-middleware>`_:en": " `wsgi-static-middleware <https://pypi.python.org/pypi/wsgi-static-middleware>`_",
    " \"この wsgi-static-middleware を使って静的ファイルを有効にしてみましょう。:en": "&quot;Let&#39;s validate the static file using this wsgi-static-middleware.",
    " WSGIのミドルウェアとして実装すると、フレームワークの実装に依存しません。 Bottleなどのフレームワークは静的ファイルの配信が少し貧弱ですが、ここで実装したミドルウェアで補うことが出来ます。:en": "When implemented as WSGI middleware, it does not depend on framework implementation. Although the distribution of static files is slightly poor in frameworks such as Bottle, it can be supplemented with the middleware implemented here.",
    " \"リクエストオブジェクト:en": "&quot;Request object",
    " \"リクエストに関する情報の扱いについて:en": "&quot;About handling information on requests",
    " 次はリクエスト情報の扱い方について考えてみましょう。 クライアントのリクエストに関する情報はWSGIアプリケーションの第一引数に辞書型のオブジェクトとして渡されることはすでに解説しました。 ルーティングに必要なリクエストのHTTPメソッドやURLパスは、次のようにこのオブジェクトから取り出す必要があります。:en": "Let&#39;s think about how to handle request information. We already explained that information on client requests is passed as a dictionary type object to the first argument of the WSGI application. The HTTP method and URL path of the request required for routing must be retrieved from this object as follows.",
    " \"また他にも様々な情報が格納されていて、例えばHTTPリクエストボディを取り出したい際には、次のように記述します。:en": "&quot;In addition, if various information is stored and you want to retrieve an HTTP request body, for example, it is written as follows.",
    " 辞書型オブジェクトから ``CONTENT_LENGTH`` と ``wsgi.input`` を取り出します。 ``env[\\\"CONTENT_LENGTH\\\"]`` には、クライアントがHTTPヘッダー ``Content-Length`` で指定したレスポンスボディの長さが格納されています。 レスポンスボディはファイルオブジェクトになっているので、 ``Content-Length`` の長さ分 ``read()`` して上げる必要があります。 リクエストボディを取り出すだけでも少し大変なように思います。:en": "We retrieve `` CONTENT_LENGTH`` and `` wsgi.input`` from a dictionary object. `` env [\\ &quot;CONTENT_LENGTH \\&quot;] `` contains the length of the response body specified by the client in the HTTP header `` Content-Length``. Since the response body is a file object, it needs to be raised by `` read () `` for the length of `` Content-Length``. I think that it is a little hard just to retrieve the request body.",
    " これらをうまくラップして使いやすくしてくれるクラスがあれば便利です。 ほとんどのWSGIフレームワークがこれをラップした「リクエストオブジェクト」を提供します。 このフレームワークにも同様に ``Request`` クラスを定義してみましょう。:en": "It is useful if you have a class that will make these easy to wrap and make it easy to use. Most WSGI frameworks provide &quot;request objects&quot; that wrap this. Let&#39;s define the `` Request`` class in this framework as well.",
    " \"WSGI Environオブジェクトをラップする:en": "&quot;Wrap the WSGI Environ object",
    " リクエストオブジェクトがどういうものかというと、WSGIのEnvironをラップしたクラスのオブジェクトです。 WSGI Environに格納されている様々なリクエスト情報をシンプルなAPIで取り出せるよう、 プロパティメソッドが定義された ``Response`` クラスを用意します。:en": "What the request object is, it is an object of a class that wraps environ of WSGI. Prepare a `` Response`` class that defines property methods so that various request information stored in WSGI Environ can be retrieved with a simple API.",
    " WSGI Environには様々な情報が格納されていますが、まずは3つだけプロパティメソッドを定義してみました。 この ``Request`` クラスのオブジェクトを渡してあげれば、フレームワークの利用者は ``body`` プロパティにアクセスするだけで、リクエストボディの情報を取得できます。 実際にはここであげた他にもたくさんの情報が詰まっているので、必要に応じて拡張していく必要がありますが基本的な考え方はこれだけです。 次はアプリケーションに組み込んでみましょう。:en": "Various information is stored in WSGI Environ, but first we have defined only three property methods. If you pass this object of the `` Request`` class, the framework user can get the information of the request body simply by accessing the `` body`` property. Actually, as there are plenty of other information in addition to what I gave here, it is necessary to expand as necessary, but this is the only basic way of thinking. Let&#39;s incorporate it into the application next time.",
    " \"アプリケーションに組み込む:en": "&quot;Built in application",
    " \"各関数には、WSGI Environの代わりに ``Request(env)`` を渡すように書き換えてみましょう。:en": "&quot;Let&#39;s rewrite each function to pass` `Request (env)` `instead of WSGI Environ.",
    " \"これで ``Request`` クラスのオブジェクトが各関数に渡せるようになりました。 アプリケーション側のインターフェイスは次のようになります。:en": "&quot;Now you can pass objects of the` `Request`` class to each function, the application side interface looks like this:",
    " リクエストボディの文字コードをすべて ``utf-8`` として扱っている点には改善の余地があります。 実際には ``Content-Type`` ヘッダーなどで指定されている ``charset`` を確認してあげるといいでしょう。 とはいえひとまず、フレームワークの利用者は簡単にリクエストボディにアクセスできるようになりました。 既存のアプリケーションを書き換えてみます。:en": "There is room for improvement in that all character codes of the request body are treated as `` utf - 8``. In fact it&#39;s a good idea to check `` charset`` which is specified in the `` Content-Type`` header. Nonetheless, users of the framework can now easily access the request body. Let&#39;s rewrite the existing application.",
    " \"リクエストオブジェクトを拡張していく:en": "&quot;Extend the request object",
    " せっかくなのでもう少し他の情報にアクセスできるようにしておきましょう。 WSGI Environに入っているすべての情報をラップすることはここではしませんが、次に挙げる項目は利用頻度が高いため、プロパティメソッドが定義されていると便利かと思います。:en": "Let&#39;s make it much more accessible to other information. Wrapping all the information contained in WSGI Environ is not done here, but since the following items are used frequently, I think that it is useful if property methods are defined.",
    " \"`query` プロパティ: URLのクエリパラメーターを手軽に取り出したい:en": "&quot;` query` property: I want to retrieve query parameters of URL easily",
    " \"``env['QUERY_STRING']`` より取り出して ``urllib.parse.parse_qs`` を用いてパースできます:en": "&quot;You can retrieve it from` `env [&#39;QUERY_STRING&#39;]` `and parse it using` `urllib.parse.parse_qs``",
    " `forms` プロパティ: ``form-urlencoded`` 形式や ``multipart`` 形式で格納されているHTMLフォーム等から送られたパラメーターを受け取りたい。:en": "`forms` property: I want to receive parameters sent from an HTML form stored in` `form-urlencoded`` form or` `multipart`` form.",
    " \"リクエストボディから取り出して、 ``cgi.FieldStorage`` を用いてパースできます。:en": "&quot;You can retrieve it from the request body and parse it using` `cgi.FieldStorage``.",
    " \"`text` プロパティ: リクエストボディをバイト列ではなくテキストで受け取りたい。:en": "&quot;` text` property: I want to receive the request body in text, not as a byte string.",
    " \"`json` プロパティ: リクエストボディの内容をjson decodeして、辞書型オブジェクトとして受け取りたい。:en": "&quot;` json` property: I want to json decode the contents of the request body and receive it as a dictionary type object.",
    " \"コードはそれほど難しくないので細かい説明は省きますが、プロパティメソッドは次のようになります。:en": "&quot;The code is not that difficult, so I will omit a detailed explanation, but the property method is as follows.",
    " \"まとめ:en": "&quot;Summary",
    " ここではリクエストオブジェクトの扱いについて見直していきました。 WSGI Environではそのままではリクエスト情報の取り出しが少し面倒でしたが、 それをラップするリクエストクラスを用意することで、プロパティメソッドを通して 様々な情報を手軽に取り出せる様になりました。 リクエストの次はレスポンス情報を扱いやすいAPIになおしていきましょう。:en": "We reviewed the handling of request objects here. In WSGI Environ, retrieving request information was a little troublesome as it was, but by preparing a request class that wraps it, various property information can be easily retrieved through property method. Let&#39;s revise the response information to a manageable API next to the request.",
    " \"レスポンスオブジェクト:en": "&quot;Response object",
    " \"レスポンス情報の扱いについて:en": "&quot;About handling response information",
    " \"リクエスト情報が簡単に取り扱えるようになったので、次はレスポンス情報の扱い方を見直します。 各エンドポイントの処理は次のように定義していました。:en": "&quot;Now that request information can be handled easily, next we will review how to handle response information.The processing of each endpoint was defined as follows.",
    " ここで気になるのは、レスポンス情報の返し方です。 WSGIのインターフェイスでは、レスポンスステータスとレスポンスヘッダーを第2引数で受け取る ``start_response`` 関数により指定します。 これはFlaskやBottleのサンプルコードに比べると、少々面倒に感じます。 もう少し簡単に管理できるように、Response情報をラップするクラスがあると便利かもしれません。 具体的には次のように各エンドポイントの処理を記述できるようにしてみます。:en": "What I care about here is how to return response information. In the WSGI interface, it is specified by the `` start_response`` function which receives the response status and the response header as the second argument. This is somewhat troublesome compared to Flask and Bottle&#39;s sample code. It might be useful to have a class wrapping the Response information so that it can be managed more easily. Specifically, we will try to describe the processing of each endpoint as follows.",
    " ``Response`` クラスというのを追加して、レスポンスボディやヘッダー情報、ステータスコードの番号をそこに指定できるようにしました。 クラスでラップしているので、デフォルトのヘッダー情報も継承を使って自由に変更することもできます。:en": "We added a `` Response`` class so that we can specify the response body, header information, and status code numbers there. Since it is wrapped in the class, you can also change the default header information freely by using inheritance.",
    " \"ヘッダー情報とステータス情報を簡単に扱う方法:en": "&quot;How to handle header information and status information easily",
    " Responseクラスを実装していく前に、ヘッダー情報とステータス情報を簡単に扱う方法を詳解します。 まずはステータス情報の扱いです。 ``start_response`` の第一引数にはステータスコードを ``200 OK`` や ``404 Not Found`` のように指定しますが、 番号に対応する文字列は決まっているので、番号の指定だけで済むほうが楽なものです。 ``http.client`` モジュールの ``responses`` オブジェクトには、ステータスコードの番号に対するメッセージが格納されています。:en": "Before implementing the Response class, I will explain in detail how to handle header information and status information easily. First of all, it deals with status information. As the first argument of `` start_response``, you specify the status code as `` 200 OK`` or `` 404 Not Found``, but since the string corresponding to the number is fixed, It is easier to specify only by designation. The `` responses`` object of the `` http.client`` module contains a message for the status code number.",
    " \"非常に簡単に取り出すことができました。ユーザーは ``200`` のように番号を指定してあげるだけで、次のようにステータスコードを生成できます。:en": "&quot;It was possible to retrieve it very easily, the user can specify the number like` `200`` and generate a status code as follows.",
    " \"ステータス情報の管理には ``wsgiref.headers`` モジュールの中にある ``Header`` クラスが便利です。:en": "&quot;The` `Header`` class in the` `wsgiref.headers`` module is useful for managing status information.",
    " ``add_header(key, value)`` メソッドをとおして、ヘッダー情報をセットします。 またWSGIの仕様上、ヘッダー情報をキーとバリューのタプルのリストを用意する必要がありますが、 ``items()`` メソッドはその形式でヘッダー情報を吐き出してくれます。:en": "We set the header information through `` add_header (key, value) `` method. In addition, according to WSGI specifications, it is necessary to prepare a list of key and value tuples for header information, but the `` items () `` method spew out header information in that format.",
    " \"Responseクラスを用意して組み込む:en": "&quot;Prepare and incorporate the Response class",
    " \"``Response`` クラスは次のようになります。:en": "&quot;The` `Response`` class looks like this:",
    " デフォルトのステータスコードやコンテントタイプをクラス変数にもたせておくことにしました。 ユーザーはレスポンスボディの内容を文字列で指定していますが、WSGIのインターフェイスではバイト文字列を yield するイテラブルなオブジェクトとして返さなくてはいけません。 ``body`` プロパティメソッドが適切に文字列をエンコードして返してくれます。:en": "We decided to put default status code and content type in the class variable. The user specifies the content of the response body as a character string, but on the WSGI interface it must return it as an iterable object that yields the byte string. The `` body`` property method properly encodes and returns the string.",
    " \"アプリケーションにも組み込んでみましょう。:en": "&quot;Let&#39;s incorporate it in the application.",
    " 組み込みはこのように非常に簡単です。これまでとは違い ``start_response`` を各関数に渡す必要はありません。 そのかわり返ってきたレスポンスオブジェクトから、ステータス情報とヘッダー情報を取り出して呼び出して上げる必要があります。:en": "Built-in is thus very simple. Unlike so far, you do not need to pass `` start_response`` to each function. Instead, we need to extract and recall the status information and header information from the returned response object.",
    " \"こうするとユーザーの定義する関数は驚くほどシンプルになります。 具体的には、次のようになりました。:en": "&quot;This will make the user-defined functions surprisingly simple, specifically:",
    " \"いかがでしょう、FlaskやBottleを使ったことのある方には随分と見慣れた形になってきたのではないでしょうか。:en": "&quot;How about you, have you used Flask or Bottle, have not it become familiar to you so much?",
    " ここではレスポンス情報の扱いを見直しました。 Responseクラスを追加することで随分ユーザーにとって使いやすいAPIに変えることができました。 実際にアプリケーションを作っていくにはまだまだ欲しい機能がありますが、ここまでくればまさにWebフレームワークと言えるものになってきたのではないでしょうか。:en": "We reviewed the handling of response information here. By adding the Response class we were able to turn it into an API that is user friendly. There are functions that I still want to make applications actually, but it seems that it has become a web framework indeed as long as it comes to this point.",
    " \"ここでは全部文字列をただ返していましたが、実際のユースケースではHTMLやJSONを返すことが多いでしょう。 その内容は次の節で扱っていきます。:en": "&quot;Although we just returned the entire string here, in actual use cases it will return HTML and JSON in many cases We will deal with the contents in the next section.",
    " \"ルーティング:en": "&quot;routing",
    " \"シンプルなルーティング:en": "&quot;Simple routing",
    " 前章では、WSGIの仕様について確認し、それを満たす小さなアプリケーションをつくりました。 ここからは実際にWebフレームワークを作っていきましょう。:en": "In the previous chapter, I checked the specification of WSGI and made a small application to satisfy it. Let&#39;s actually make a web framework from here.",
    " 先程のアプリケーションでは、URLのパス情報によらず全て「Hello World」と返しています。 実際のアプリケーションでは、沢山のページが存在するためパス情報に応じてそれぞれ違ったレスポンスを返す必要があります。 最も簡単なルーティング方法を次に示します。:en": "In the previous application, it returns &quot;Hello World&quot; regardless of the path information of the URL. In an actual application, since there are many pages, it is necessary to return different responses according to the path information. The simplest routing method is shown below.",
    " WSGIのアプリケーションの第一引数には、辞書型オブジェクトが渡されています。 これは WSGI Environment と呼ばれ、クライアントから受け取ったリクエストの情報が格納されています。 リクエストのパス情報もその一つで、 `PATH_INFO` により取り出すことができます。 またHTTPのメソッドも同様に ``REQUEST_METHOD`` により取り出すことができます。:en": "As a first argument of WSGI&#39;s application, a dictionary type object is passed. This is called WSGI Environment, which stores information on requests received from clients. The path information of the request is one of them and can be retrieved by `PATH_INFO`. Also HTTP methods can be retrieved by `` REQUEST_METHOD`` as well.",
    " \"URL変数と正規表現によるルーティング:en": "&quot;URL variable and regular expression routing",
    " \"URL変数:en": "&quot;URL variable",
    " \"もう少し複雑なケースを考えてみましょう。 こちらのBottleのアプリケーションの一部を見てください。:en": "&quot;Consider a more complicated case, please look at some of the applications of Bottle here.",
    " `/hello/foo` と `/hello/bar` はそれぞれ別のエンドポイントですが、上のコードではどちらも `greet` 関数が呼ばれます。 またURLのパス情報から `foo` や `bar` などの変数(以下、URL変数)を取り出しています。:en": "`/ hello / foo` and` / hello / bar` are different endpoints, but in the code above the `greet` function is called. Variables such as `foo` and` bar` (URL variable) are taken from the path information of the URL.",
    " \"先程のようにif文で分岐させていくのは大変なので、別の方法を考えてみましょう。 解決策の一つとして正規表現の利用があります。:en": "&quot;Since it is difficult to branch with an if statement as before, let&#39;s consider another method.There is use of regular expression as a solution.",
    " \"正規表現モジュール:en": "&quot;Regular Expression Module",
    " `正規表現 <http://docs.python.jp/3/library/re.html>`_ は普段使わない方も多いかと思います。 ここで簡単におさらいしましょう。:en": "`Regular Expression <http://docs.python.jp/3/library/re.html> I think that there are also many people who do not normally use _. Here&#39;s a quick overview.",
    " \"このように名前付きグループでパターンを定義し、マッチするか確認してからgroupdictを呼ぶことでuser_idの部分の数字が文字列で取得出来ます。:en": "&quot;By defining a pattern in a named group and checking if it matches like this, you can get the number in user_id as a string by calling groupdict.",
    " \"構成図:en": "&quot;Diagram",
    " \"それでは、ルーティング機能を提供するため、フレームワークの実装を始めましょう。 ここで提供するルーティングは次のようなイメージです。:en": "&quot;Let&#39;s start implementing the framework to provide the routing function.The routing provided here is as follows.",
    " \"ルーティングのイメージ。 パス情報にあわせて別のアプリケーションを呼び出す。:en": "&quot;Routing image. Call another application according to path information.",
    " \"それでは図のRouterを実装していきましょう。:en": "&quot;Let&#39;s implement the routers in the figure.",
    " \"Routerクラス:en": "&quot;Router class",
    " \"それではルーティングの機能を提供する ``Router`` クラスを用意していきます。 このクラスには2つのメソッドを用意します。:en": "&quot;Now we will prepare a` `Router`` class that provides routing capabilities, and we have two methods for this class.",
    " \"``add()``: 各コールバック関数(WSGIアプリケーションオブジェクト)が、どのURLパス・HTTPメソッドに紐づくかを登録する。:en": "&quot;` `add ()` `: Register which URL path · HTTP method is associated with each callback function (WSGI application object).",
    " \"``match()``: 実際に受け取ったリクエストのパスとHTTPメソッドの情報を元に登録していたコールバック関数とURL変数を返す。:en": "&quot;` `match ()` `: Returns the callback function and URL variable registered based on the path of the actual request and information on the HTTP method.",
    " \"まずは ``add()`` メソッドから定義してみましょう。:en": "&quot;Let&#39;s start by defining it from the` `add ()` `method.",
    " HTTPメソッドとパス、それに紐づくコールバック関数を辞書型のオブジェクトにつめて、リストに追加しました。 非常に簡単です。呼び出し側はどのようになるでしょうか？ ``match()`` メソッドを定義します。:en": "We added HTTP methods, paths, and callback functions associated therewith to dictionary type objects and added them to the list. Very easy. What will the caller look like? Define `` match () `` method.",
    " このメソッドでは、 ``add()`` メソッドで登録したエンドポイントのパス情報とメソッド情報が一致するかをチェックします。 もし一致した場合には、URL変数を取り出し、ひも付けられていたコールバック関数を返します。 一致しない場合には、 ``404 Not Found`` を返すようになりました。 こちらも非常にシンプルなコードですが、基本的にルーティングに必要な機能を備えています。 念の為動作も確認しましょう。:en": "In this method, it checks whether the path information and method information of the endpoint registered by the `` add () `` method match. If it matches, it retrieves the URL variable and returns the callback function that was tied. If they do not match, `` 404 Not Found`` is now returned. This is also a very simple code, but basically it has the necessary functions for routing. Just to be sure, let&#39;s check the operation.",
    " \"うまく動作していることが確認できます。 ここではついでに2つ改善を加えておきましょう。:en": "&quot;It can be confirmed that it works well. Let&#39;s add two improvements in addition here.",
    " \"パスは定義されているもののメソッドだけが一致しない場合には ``405 Method Not Allowed`` を返す。:en": "&quot;If the path is defined but only the methods do not match, it returns` `405 Method Not Allowed``.",
    " \"``re.compile()`` は ``Router.add()`` メソッドの呼び出し時に行っておく。:en": "&quot;` `re.compile ()` `is done when calling the` `Router.add ()` `method.",
    " \"修正を加えると全体像は次のようになります。:en": "&quot;If you make corrections, the overall picture looks like the following.",
    " 他にもいろいろと考えることはありますが、今はこれくらいにしておきます。 それでは ``Router`` クラスを実際にアプリケーションに組み込んでいきます。:en": "There are other things to think about, but I will keep it for now. So we will actually include the `` Router`` class in the application.",
    " \"Routerを組み込んだWSGIのアプリケーション用クラスを作る:en": "&quot;Make a WSGI application class that incorporates Router",
    " ``Router`` クラスを組み込んで行きたいのですが、関数のままだと少し扱いづらいです。 ここではWSGIアプリケーションをクラスで定義してみましょう。:en": "I&#39;d like to incorporate the `` Router`` class, but it&#39;s a bit hard to handle if you keep the function. Let&#39;s define the WSGI application in the class here.",
    " ここで注目してほしいのは ``__call__()`` メソッドが定義されている点です。 ``__call__`` メソッドを定義すると、このクラスのオブジェクト自身が呼び出し可能(callable)になります。 つまり ``app = App()`` は、関数 ``def app(env, start_response): pass`` 同じように振る舞ってくれます。 これでだいぶ拡張がしやすくなりました。 ``Router`` クラスを組み込んでみましょう。:en": "The point to watch out here is that the `` __call __ () `` method is defined. If you define the `` __call__`` method, the object of this class is itself callable. In other words, `` app = App () `` behaves in the same way as the function `` def app (env, start_response): pass``. This makes it much easier to expand. Let&#39;s include the `` Router`` class.",
    " ``route`` デコレーターを使ってコールバック関数にHTTPメソッドと正規表現で書かれたパスを割り当てできるようにしました。 このフレームワークの利用者からは、次のような形で利用出来ます。:en": "You can now use the `` route`` decorator to assign paths written in HTTP methods and regular expressions to callback functions. Users of this framework can use it in the following form.",
    " 実際にアプリケーションを実行して動作確認してみましょう。 定義されたエンドポイントにアクセスすると、次のように正しくレスポンスを受け取ることができます。:en": "Let&#39;s actually run the application and check its operation. By accessing the defined endpoint, you can receive the correct response as follows:",
    " \"一方で定義されていないパスや、メソッドが定義されていないエンドポイントでは、404 や 405が返ってきます。:en": "&quot;On the other hand, 404 or 405 will be returned for paths that are not defined, or endpoints for which methods are not defined.",
    " ここまでルーティングの役割について考え、実装しました。 用意した ``Router`` クラスは、正規表現で記述されたパスにマッチするかどうかを判定し、 マッチした場合には登録しておいたコールバック関数とURL変数を返してくれます。 デコレーターでルーティングの情報を指定することで、ユーザーは複数のエンドポイントを見通しよく定義できるようになりました。:en": "I thought about the role of routing so far and implemented it. The prepared `` Router`` class determines whether or not it matches the path described in the regular expression, and if it matches, it returns the registered callback function and URL variable. By specifying routing information with a decorator, users can better define multiple endpoints forepectedly.",
    " \"WIP: WSGIサーバーのつくりかた:en": "&quot;WIP: How to create a WSGI server",
    " WSGIアプリケーションフレームワークとして最低限必要な機能をある程度実装しました。 200行弱のフレームワークですが、ルーティングやリクエストオブジェクト、レスポンスオブジェクトを実装したことで、 WSGIのインターフェイスよりは随分使いやすくなりました。:en": "We implemented the minimum necessary functions as WSGI application framework to some extent. It is a framework of less than 200 lines, but by implementing routing, request object, response object, it is much easier to use than the WSGI interface.",
    " 次はHTTP 1.xの解説も兼ねて、WSGIサーバーの作り方についてお話します。 作るのは150行に満たないWSGIサーバーですが、手元のDjangoアプリケーションも問題なく動かすことができました。 パフォーマンスや脆弱性の問題を抱えてはいますが、動作を理解するにはうってつけです。:en": "Next, I will talk about how to make a WSGI server as a commentary on HTTP 1.x. I make less than 150 lines of WSGI server, but I was able to run Django application at hand without trouble. I am having problems with performance and vulnerability, but it is perfect for understanding the behavior.",
    " \"ソケットモジュールを使ったTCP通信:en": "&quot;TCP communication using a socket module",
    " \"日頃の業務の中で、TCPのsocket通信プログラムを書くことはあまりないかもしれません。 もし難しければ定型文として、覚えてもらっても大丈夫です。:en": "&quot;In my daily work, I may not write TCP socket communication program so much, so if it is difficult, I can remember it as a fixed form sentence.",
    " \"なにかリクエストを受け取ったら ``Hello`` とだけ返し、接続を終了するシンプルなプログラムです。:en": "&quot;It is a simple program that simply returns` `Hello`` if it receives any request and ends the connection.",
    " \"HTTP レスポンスを返す:en": "&quot;Return HTTP response",
    " \"ブラウザーで開いてみてください。:en": "&quot;Please try opening it in the browser.",
    " \"クラスに載せる:en": "&quot;Post your class",
    " \"JSONやHTMLを返す:en": "&quot;Return JSON or HTML",
    " \"*この章はまだ書き途中です。気が向いたときに書き直していきますがこの資料の感想をいただけると頑張るかもしれません*:en": "&quot;* This chapter is still in the process of being written.I will rewrite it when I feel it, but if I receive the impression of this material it may work hard *",
    " \"JSONResponseクラスを用意する:en": "&quot;Prepare the JSONResponse class",
    " Responseオブジェクトは文字列を返すのには非常に向いていました。 実際Webアプリケーションを開発する中ではこのように文字列を返すことはあまりなく、 Webブラウザで表示するためのHTMLを返したり、クライアントアプリケーションのためにJSON形式のAPIを用意することのほうが多くあります。 まずはJSON APIの開発に便利な JSONResponse クラスを用意してみましょう。:en": "The Response object was very suitable for returning strings. In fact when developing a web application, it is rare to return such a string in this way, and there are more cases to return HTML for displaying in a web browser or to prepare a JSON format API for client applications. Let&#39;s first prepare the JSONResponse class which is useful for developing JSON API.",
    " \"Jinja2を使ってHTMLを返す:en": "&quot;Return HTML using Jinja 2",
    " BottleやDjangoのようなフレームワークでは自前でテンプレートエンジンを用意していますが、 今回は、デファクトスタンダードとなっているJinja2を使ってHTMLを返していきましょう。:en": "In the framework like Bottle and Django, we prepare our own template engine, but this time, let&#39;s return HTML using Jinja 2 which is the de facto standard.",
    " \"Jinja2 おさらい:en": "&quot;Jinja 2 Review",
    " \"Jinja2の使い方をおさらいしてみましょう.:en": "Let&#39;s review how to use Jinja 2.",
    " \"TemplateResponse クラス:en": "&quot;TemplateResponse class",
    " \"それではこれを簡単に扱えるようなResponseクラスを用意します。:en": "&quot;We will prepare a Response class that can handle this easily.",
    " \"render_bodyを呼び出す際に、environmentを渡す必要があるため、つぎのようにAppクラスを書き換えましょう.:en": "&quot;When calling render_body, we need to pass environment, so let&#39;s rewrite the App class as follows.",
    " \"これで実装はOKです。使ってみましょう。:en": "&quot;Implementation is OK with this, let&#39;s use it.",
    " \"`main.py`:en": " \"`main.py`",
    " \"`templates/users.html`:en": " \"`templates/users.html`",
    " \"WSGI について:en": "About WSGI",
    " \"アプリケーション・サーバ間のやりとり:en": "&quot;Application-server interaction",
    " FlaskやDjangoで書かれたアプリケーションを動かすときは、当然ですがサーバーが必要になります。 本番環境で動かすときには gunicorn や uWSGI が広く利用されます。:en": "When running an application written in Flask or Django, of course, a server is necessary. When running in a production environment gunicorn and uWSGI are widely used.",
    " 実はPythonの標準ライブラリの中にも ``wsgiref`` というサーバー実装が存在します。 シングルスレッドでしか動作しないなど性能面の問題はありますが、標準ライブラリに含まれていて別途インストールする必要はないため、 開発環境ではこちらが使われることも多くあります。 例えばFlaskクラスが提供する ``run()`` メソッドや、Djangoの ``manage.py runserver`` はデフォルトで wsgiref を利用します。:en": "Actually there is also a server implementation called `` wsgiref`` in the Python standard library. Although there are performance issues such as it only works with single thread, it is included in the standard library and there is no need to install it separately, so this is often used in the development environment. For example, the `` run () `` method provided by Flask class and Django `` manage.py runserver`` will use wsgiref by default.",
    " Webアプリを開発する際には、これらのサーバ上で作成したアプリケーションを動かしますが、 具体的にWebサーバと私達の開発しているアプリケーションがどのようなやりとりを行っているのか、日頃の開発の中で意識することは少ないのではないでしょうか。 しかし、Webフレームワークを開発するとなるとどのようにやり取りが行われているのかを知っておく必要があります。:en": "When developing a Web application, I will run applications created on these servers, but I will explain in detail what kind of exchanges between the Web server and the application we are developing, daily development There is not much to be aware of within. However, when developing a Web framework it is necessary to know how exchanges are being done.",
    " \"サーバとアプリケーションの間では何かしらのやり取りが行われています。:en": "&quot;There is some communication between the server and the application.",
    " PythonではアプリケーションとWebサーバのインタフェースとして `PEP3333 <https://www.python.org/dev/peps/pep-3333/>`_ で定義された WSGI(Web Server Gateway Interface)という仕様が広く利用されています。 DjangoやFlask、Bottle、Pyramid などの有名なPythonのWebフレームワークはどれもWSGIの仕様に準拠しています。 ここでは私達も WSGI の仕様に準拠したアプリケーションフレームワークを開発していきます。 こうすることで gunicorn や uWSGI などの優れた既存のWSGIサーバーを利用できます。:en": "In Python, as an interface between an application and a Web server `PEP 3333 <https://www.python.org/dev/peps/pep-3333/> WSGI (Web Server Gateway Interface) specification defined by `_ is widely used. Every well-known Python web framework such as Django, Flask, Bottle, Pyramid, etc. conforms to WSGI specifications. Here we will also develop an application framework that conforms to WSGI specifications. By doing this you can use an excellent existing WSGI server such as gunicorn or uWSGI.",
    " `PEP3333 <https://www.python.org/dev/peps/pep-3333/>`_ で定義されているはWSGIのversionは v1.0.1 ですが、 PEPではその前のバージョンとして `PEP333 (WSGI v1.0) <http://www.python.org/dev/peps/pep-0333/>`_ も存在します。 PEP333 はPython 2を前提としていましたが、Python3から文字列の扱いが大きく変化したためそれに合わせてアップデートされ、 その他の細かい仕様変更が PEP3333 には加わっています。:en": "`PEP 3333 <https://www.python.org/dev/peps/pep-3333/> The WSGI version defined in `_ is v1.0.1, but in PEP,` PEP 333 (WSGI v 1.0) <http://www.python.org/dev/peps/pep-0333/> `_ Also exists. Although PEP 333 assumed Python 2, since the handling of the character string changed significantly from Python 3, it was updated accordingly, and other detailed specification changes were added to PEP 3333.",
    " \"WSGI (Web Server Gateway Interface):en": " \"WSGI (Web Server Gateway Interface)",
    " それではWSGIの仕様について勉強していきましょう。 PEP3333 を全て読むのは大変なので、実際のPythonのコードをベースに概要だけ理解していきましょう。:en": "Let&#39;s learn about the specification of WSGI. It is hard to read all PEP 3333, so let&#39;s understand only the outline based on the actual Python code.",
    " \"このたった3行のPythonのコードはWSGIの仕様を満たしています。 それではどのような仕様だったのでしょうか？行ごとに説明していきます。:en": "&quot;This 3 lines of Python code fulfills the WSGI specification.What kind of specification was then? I will explain each line.",
    " \"WSGIのアプリケーションは、2つの引数を持った呼び出し可能なオブジェクトである:en": "&quot;WSGI&#39;s application is a callable object with two arguments",
    " \"第2引数として渡されたオブジェクトを呼び出し、HTTPステータスコードとヘッダ情報を渡す:en": "&quot;Call the object passed as the second argument and pass the HTTP status code and header information",
    " \"レスポンスボディとしてバイト文字列をyieldするiterableなオブジェクトを返す。:en": "&quot;Return an iterable object that yields a byte string as a response body.",
    " いかがでしょうか。とてもシンプルなインタフェースです。 たった3行のコードですが、本当にWSGIの仕様を満たしているのであれば、gunicornやuWSGIといった おなじみのWSGIサーバで動かすことができるはずですね。 実際に動かしてみましょう。 上のコードを `hello.py` という名前で保存し、下記のコマンドを実行してください。:en": "What do you think. It is a very simple interface. It is only three lines of code, but if it really meets the WSGI specifications, you should be able to run it on a familiar WSGI server such as gunicorn or uWSGI. Let&#39;s actually move it. Save the above code as `hello.py` and execute the command below.",
    " \"3行のコードをgunicornで動かしてみる:en": "&quot;Let&#39;s move 3 lines of code with gunicorn",
    " 動きましたか？正常に動作した場合はWebブラウザなどでアクセスすると、上のGIFアニメーションのように `Hello World` と表示されるはずです。 それでは次の章でこれから作るWebフレームワークに必要な機能を考えていきましょう。:en": "Have you moved? If it works normally, when accessing with a web browser etc., it should be displayed as `Hello World` like the above GIF animation. Let&#39;s think about the functions necessary for the future web framework in the next chapter.",
    " \"フレームワークに求められる機能とは？:en": "&quot;What is required of the framework?",
    " Hello Worldを表示するだけの簡単なアプリケーションであれば、フレームワークを使わずに実装することが出来ました。 それではこれからWebアプリケーションを開発する上で、Webフレームワークがどのような機能を提供すると楽になるでしょうか。 Webアプリケーションの開発経験がある方なら、このあたりは容易に想像がつくでしょう。 例として次のような機能があると開発が楽になりそうです。:en": "If it was a simple application that only displayed Hello World, it could be implemented without using framework. So what kind of function does the Web framework provide for Web application development in the future? If you are experienced in web application development, this area will be easy to imagine. As an example, development will be easier if you have the following functions.",
    " 先ほどのHello WorldのアプリケーションはどこにアクセスしてもHello Worldが返ってきます。 実際のWebサイトにはたくさんのページが存在し、URLやHTTPメソッドに応じてサーバー側の処理が異なります。:en": "Hello World comes back no matter where you access the application of Hello World. There are many pages on the actual Web site, and processing on the server side depends on the URL and HTTP method.",
    " \"リクエストオブジェクト・レスポンスオブジェクト:en": "&quot;Request object · Response object",
    " リクエスト情報は、WSGIアプリケーションの第一引数として提供されますが、こちらは辞書型のオブジェクトです。 ここから直接、GETのクエリパラメータやその他のリクエスト情報を取り出すのは大変なため、 それらの情報をうまくラップしてくれるクラスがあるといいでしょう。 またレスポンスのヘッダ情報やステータス情報もうまく管理してくれるクラスがあるとよさそうです。:en": "Request information is provided as the first argument of the WSGI application, but this is a dictionary type object. Since it is difficult to retrieve GET&#39;s query parameters and other request information directly from here, it would be nice to have a class that successfully wraps that information. Also, it seems to be good if there are classes that manage the header information and status information of the response well.",
    " \"HTMLテンプレート:en": "&quot;HTML template",
    " HTMLを表示する際に、Pythonの変数を評価して埋め込めると便利です。 BottleやDjangoのように、自前でテンプレートエンジンを用意してもいいかもしれませんが、Jinja2などすでに 広く利用されているテンプレートエンジンのローダがあると便利かもしれません。 今回は一から実装はせずに、Jinja2のテンプレートエンジンのローダを用意します。:en": "It is useful to evaluate and embed Python variables when displaying HTML. Like Bottle and Django, you may be able to prepare a template engine on your own, but it may be useful to have a loader of template engine already widely used such as Jinja 2. In this time we will prepare a Jinja 2 template engine loader without implementing it from scratch.",
    " CSSやJS、画像ファイルなどの静的ファイルは、本番環境の場合、 Nginx 等で返す場合が多いかもしれません。 しかし開発中や手元のパソコンでも Nginx の設定をして静的ファイルを返すように設定するのは面倒なので、 フレームワークにも静的ファイルを返す機能があると開発が捗りそうです。:en": "Static files such as CSS, JS, and image files are often returned by Nginx etc. in the production environment. However, it is troublesome to set Nginx settings and return static files on the PC at hand or at hand, so development seems to be improving if the framework also has a function to return static files.",
    " \"今回作成するWebフレームワーク:en": "&quot;Web framework to create this time",
    " \"使い方:en": "How to use",
    " この資料で作成するフレームワークを使うと次のようにコードを記述出来ます。 FlaskやBottleでの開発に慣れた方であれば、簡単に扱えることができるのではないでしょうか。:en": "Using the framework created in this document, you can write the code as follows. If you are accustomed to developing with Flask or Bottle, you can easily handle it.",
    " \"全体像:en": "&quot;All images",
    " \"今の時点で理解できている必要はありませんが、フレームワークの全体像も載せておきます。:en": "&quot;It is not necessary to understand at this point, but I will also put a big picture of the framework.",
    " \"フレームワークの全体像:en": "&quot;The whole picture of the framework",
    " Router や Request 、 Response クラスを1つずつ実装していけば、徐々に上の図に書かれているフレームワークに近づいていきます。 この資料を読み終えるころにはBottleやFlaskのようなフレームワークがどのように構成されているのかコンセプトも含めてイメージできるようになるでしょう。:en": "Implementing Router, Request, Response class one by one gradually approaches the framework described in the above figure. By the time you finish reading this material you will be able to imagine including concepts on how frameworks such as Bottle and Flask are organized.",
    " この章ではWSGIの概要について解説しました。 またWSGIの提供するインターフェイスでは足りない機能を解説し、これからつくるWebフレームワークの完成形について紹介しました。 ここからは一緒にWSGIのアプリケーションフレームワークを作っていきましょう。:en": "This chapter explained the outline of WSGI. In addition, the interface provided by WSGI explains the missing functions and introduced the completion form of the Web framework to be created. Let&#39;s make the application framework of WSGI together from now."
}